[
  {
    "title": "Frank Adriano Set to Launch 'Student Engagement Week' — A Fresh Step Toward Inclusive Leadership at Mzuzu University",
    "date": "06 December 2025",
    "author": "Hawkins Kalambo",
    "image": "assets/images/news1.jpeg",
    "description": "In a move that reflects active and collaborative leadership, Speaker Candidate Frank Adriano has announced the Student Engagement Week — a program designed to bring students and leadership closer through open forums, workshops and department-to-department interaction.",
    "link": "#manifesto",
    "content": "MZUZU UNIVERSITY - In a groundbreaking move that reflects active and collaborative leadership, Speaker Candidate Frank Adriano has announced the establishment of a new initiative called Student Engagement Week. This innovative program is designed to bridge the gap between students and university leadership through meaningful dialogue and interaction.\n\nUnlike traditional political campaigns that often focus solely on promises, this initiative aims to create real-time dialogue spaces, open forums, campus tours, and department-to-department interactions. Students will have the opportunity to freely express their concerns, propose innovative solutions, and actively participate in shaping decisions that directly impact their campus life.\n\nDuring recent campaign discussions, Frank Adriano emphasized that \"leadership must be present and accessible — not only during elections, but throughout the entire journey.\" As a result, Student Engagement Week will serve as a monthly interaction platform that empowers students to:\n\n• Report challenges directly to university representatives\n• Share innovative development ideas\n• Track progress on ongoing campus projects\n• Participate in mini-workshops and leadership discussions\n• Strengthen unity and campus community spirit\n\nThis pioneering initiative is expected to foster greater transparency, accountability, and a vibrant culture of student involvement — core principles that Frank Adriano has championed throughout his campaign.\n\nThe announcement has generated significant excitement across the Mzuzu University campus, with students expressing admiration for a candidate who is already thinking beyond electoral victory and focusing on genuine service.\n\nFurther details regarding implementation, scheduling, and featured activities will be announced soon through the official campaign website.",
    "linkLabel": "Read More"
  }
]
